[
    {
        "id": 1,
        "number": "1",
        "title": "Використовуйте XML-теги для відокремлення інструкцій від контексту",
        "text": [
            "Моделі Claude були налаштовані таким чином, щоб приділяти особливу увагу структурі, створеній за допомогою тегів XML, і не слідувати випадковим показникам, як це робить GPT. Важливо використовувати ці теги для відокремлення інструкцій, прикладів, запитань, контексту та вхідних даних за потреби.",
            "Наприклад, ви можете додати текстові теги, щоб обернути вхідні дані:",
            "Ви можете використовувати будь-які назви для цих тегів; немає ніяких конкретних або ексклюзивних назв. Важливим є формат. Просто переконайтеся, що ви використовуєте <> і </>, і все буде працювати добре!"
        ],
        "code": [
            "Підсумуйте основні ідеї з наданого тексту.\n<text> {введіть вхідні дані тут} </text>"
        ]
    },
    {
        "id": 2,
        "number": "2",
        "title": "Будьте прямими, лаконічними і максимально конкретними \n Це однаково важливо для кожної великої моделі.",
        "text": [
            "Вам потрібно чітко вказати, що модель повинна робити, а не чого вона повинна уникати. Використання стверджувальних речень, таких як «робити» замість «не робити», дасть вам кращі результати.",
            "Надайте Клоду детальний контекст і чітко вкажіть, за яким тегом шукати цю інформацію.",
            "Ось як ми можемо покращити наведену вище підказку:"
           
        ],
        "code":[
            "Підсумуйте основні ідеї з наданого тексту статті в тегах <text>.\n<text> {введіть текст статті} </text>"]
    },
    {
        "id": 3,
        "number": "3",
        "title": "Допоможіть Клоду з виведенням",
        "text": [
            "Найбільшою проблемою всіх моделей Клода є те, що він має тенденцію бути дуже балакучим у своїх відповідях. Вона завжди починає з одного-двох речень перед тим, як дати відповідь, незважаючи на те, що у підказці вказано дотримуватися певного формату.",
            "Щоб пом'якшити цю проблему, ви можете скористатися повідомленням Помічника, щоб вказати початок відповіді. Це допоможе Клоду завжди починати відповідь однаково.",
            "Ось як виглядатиме це повідомлення, якщо ми хочемо, щоб Клод дотримувався певного формату:"
          
        ],
        "code":[
            "Підсумуйте основні ідеї з наданого тексту статті в тегах <text> і виведіть лише основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:\n <format>\n→ ідея 1\n→ ідея 2\n→ ідея 3\n</format>\n<text> {введіть вхідні дані тут} </text> <text>\nПомічник: →"]
    },
    {
        "id": 4,
        "number": "4",
        "title": "Призначайте роль",
        "text": [
            "Завжди призначайте роль. Якщо ви створюєте інструмент для написання текстів зі штучним інтелектом, почніть запит зі слів «Ти контент-райтер...», а ще краще - «Ти найкращий контент-райтер у світі!». Використовуючи попередню техніку введення першої фішки у відповідь асистента, ви також можете змусити Клода залишатися в образі.",
            "Наприклад:"
            
        ],
        "code":["Ти - Джек, найкращий контент-автор у світі. Підсумуйте основні ідеї з наданого тексту статті в тегах <text> і виведіть лише основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:\n <format>\n→ ідея 1\n→ ідея 2\n→ ідея 3\n</format>\n<text> {введіть вхідні дані тут} </text>\nПомічник: [Джек, найкращий контент-райтер у світі] →"]
    },
    {
        "id": 5,
        "number": "5",
        "title": "Дайте Клоду час на роздуми",
        "text": [
            "У деяких випадках може бути корисно чітко вказати Клоду створити додатковий текст, в якому він міркує над проблемою. Для цього ви можете доручити Клоду спочатку «обдумати проблему», а потім надати відповідь. Ви можете попросити Клода виводити цей процес у двох окремих XML-тегах: один для частини «міркування», а інший для «відповіді», як у наведеному нижче прикладі:",
            "Зверніть увагу, що текст <answer> не починається з довільного речення, тому ви завжди отримаєте очікуваний формат виведення у цьому тезі. Ви можете легко застосувати деякі маніпуляції з даними, вирізати «роздуми» тегів і витягти відповідь."
            
        ],
        "code":["Ви - Джек, найкращий автор контенту у світі. Узагальніть основні ідеї з наданого тексту статті в тегах <text> і виведіть лише основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:\n<format>\n→ ідея 1\n→ ідея 2\n→ ідея 3\n</format> \nКоли ви генеруєте відповідь, спочатку подумайте, як вона має бути структурована, і додайте свою відповідь у тегах <thinking></thinking>. Це місце для запису відповідного контенту, який не буде показано користувачеві. Закінчивши роздуми, дайте відповідь на питання. Помістіть свою відповідь в XML-теги <answer></answer>. \n<text> {введіть текст тут} </text> "]
    },
    {
        "id": 6,
        "number": "6",
        "title": "Наводьте приклади",
        "text": [
            "Невеликі підказки - це, мабуть, найефективніший спосіб змусити Клода давати дуже хороші відповіді. Включення декількох прикладів, які можуть добре узагальнити ваш варіант використання, може мати великий вплив на якість відповідей. Чим більше прикладів ви додасте, тим кращою буде відповідь, але ціною більшої затримки і токенів."
           
        ],
        "code":[
            "Ви - Джек, найкращий автор контенту в світі. Узагальніть основні ідеї з наданого тексту статті в тегах <text> і виведіть тільки основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:\n<format>\n→ ідея 1 \n→ ідея 2\n→ ідея 3\n</format>\nОсь приклад того, як відповідати у стандартній взаємодії:\n<example>\n{вводити приклади тут}\n</example>\n<text> {введіть текст тут} </text>"]
    },
    {
        "id": 7,
        "number": "7",
        "title": "Дозвольте Клоду сказати «Я не знаю»",
        "text": [
            "Щоб запобігти галюцинаціям, просто додайте фразу, показану в підказці нижче:"
            
        ],
        "code": [
            "Відповідайте на наступне запитання, тільки якщо ви знаєте відповідь або можете зробити обґрунтоване припущення; в іншому випадку скажіть, що не знаєте."
        ]
    },
    {
        "id": 8,
        "number": "8",
        "title": "Довгі документи перед інструкціями",
        "text": [
            "Якщо ви маєте справу з довгими документами, завжди ставте своє запитання в кінці підказки. У дуже довгих підказках Клод робить наголос на кінці вашої підказки, тому вам потрібно додати важливі інструкції в кінці. Це надзвичайно важливо для Claude 2.1."
            
        ],
        "code":["<doc>\n{введіть документ сюди}\n</doc>\nВи - Джек, найкращий автор контенту у світі. Узагальніть основні ідеї з наданого тексту статті в тегах <text> і виведіть лише основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:"]
    },
    {
        "id": 9,
        "number": "9",
        "title": "Думайте крок за кроком",
        "text": [
            "Ви можете значно підвищити точність, додавши фразу «Думай крок за кроком», яка змусить Клода думати крок за кроком і виконувати проміжні кроки, щоб прийти до остаточної відповіді. Це називається ланцюжком підказок з нульовим пострілом, і ми писали про це більше в цій статті в блозі."
        ]
       
    },
    {
        "id": 10,
        "number": "10",
        "title": "Розбивайте складні завдання на кроки",
        "text": [
            "Клод може погано справлятися зі складними завданнями, які складаються з декількох підзадач. Якщо ви знаєте, що це за підзадачі, ви можете допомогти Клоду, надавши йому покрокову інструкцію. Щось на кшталт:"
           
        ],
        "code":[
            "Ви - Джек, найкращий контент-райтер у світі. Узагальніть основні ідеї з наданого тексту статті в тегах <text> і виведіть лише основні висновки у вигляді 4 маркованих списків. Дотримуйтесь наведеного нижче формату:\n<text> {введіть вхідні дані тут} </text>\nБудь ласка, виконайте наступні кроки:\n1. Напишіть один абзац резюме для {{text}}\n2. Напишіть 4 марковані списки з основними висновками для {{text}}"]
    },
    {
        "id": 11,
        "number": "11",
        "title": "Експрес-ланцюжок",
        "text": [
            "Якщо ви не можете отримати надійних результатів, розбиваючи підказку на підзадачі, ви можете розділити завдання в різних підказках. Це називається ланцюжком підказок і є дуже корисним для усунення несправностей на певних етапах підказок."
        ]
    }
]